blogger2/app/controllers/articles_controller.rb

	def update
		@article = Article.find(params[:id])
		@article.update(article_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "articles" SET "image_content_type" = ?, "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = 10