blogger2/app/controllers/authors_controller.rb

INSERT INTO "authors" ("created_at", "email", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-04-27 11:34:39.966759"], ["email", "g"], ["updated_at", "2014-04-27 11:34:39.966759"]]
---
  def create
    @author = Author.new(author_params)
    respond_to do |format|
      if @author.save